{
  "version":"0.1",
  "pageContent":{
    "_comments":"object that contains data for page labels, buttons, etc.",
    "navItems":{
      "_common":{
        "buttonBackToGallery":{
          "name":"Back To Gallery",
          "method":"backToGallery()",
          "idName":"backToGallery"
        },
        "buttonStartTutorial":{
          "name":"Start Tutorial",
          "method":"startTutorialFromDetailsScreen()",
          "idName":"startTutorial"
        },
        "buttonViewDetails":{
          "name":"View Details",
          "method":"viewDetails()",
          "idName":"stepsViewDetails"
        }
      }
    }
  },
  "tutorial":{
    "_common":{
      "name":"Aggregation nodes using CallableFlowAsyncInvoke nodes with back-end services",
      "shortDescription":"Learn how to use the Aggregation nodes to fan-out and fan-in messages using asynchronous Callable Flow nodes.",
      "durationText":"This tutorial takes approximately",
      "durationTime":"5 minutes",
      "_resourceToOpenComment":"The ID of the first resource to open when the user imports the tutorial. Resource IDs are defined in the repo_metadata.json Tutorials listing on ot4i.",
      "resourceToOpen":"MainFlow",
      "helpLink":{
        "text":"IBM Knowledge Center",
        "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.ace.home.doc/help_home.htm"
      }
    },
    "pageDetails":{
      "topicsName":"Tutorial Topics",
      "_topicListComment":"A short list of product concepts or tasks demonstrated by this tutorial",
      "topicList":[
        {
          "title":"Aggregation nodes"
        },
        {
          "title":"Asynchronous Callable Flows"
        }
      ],
      "outcomesName":"Learning outcomes",
      "_outcomesComment":"A description of what the user will have learned or accomplished by running this tutorial.",
      "outcomeList":[
        {
          "title":"Use IBM App Connect Enterprise to fan-out asynchronous Callable Flow invocations and aggregate their responses."
        }
      ],
      "summary":{
        "overviewName":"OVERVIEW",
        "_overviewComment":"A short description of what happens in this tutorial, and an optional short explanation of the ACE concepts used in this tutorial if necessary for context. What background knowledge must the user have for this to make sense?",
        "sections":[
          {
            "section":"This tutorial demonstrates a simple REST API that receives an HTTP GET, and fans-out two separate asynchronous Callable Flow invocations (after simple transformations using a Mapping node). Two separate example back-end message flows are provided which receive these requests, do a trivial transformation to upper-case the data, and reply. The fan-in part of the REST API aggregates values from the two response messages together."
          },
          {
            "section":"This tutorial requires an ACE integration node (or standalone server) which is associated with a local queue manager."
          },
          {
            "section":"In IBM App Connect Enterprise, an application is a container for all the resources that are required to create a solution. A REST API is a specialized form of an application which describes a set of resources, and a set of operations that can be called on those resources from any HTTP client. This tutorial provides a REST API which holds the fan-out / fan-in aggregation flow, and two other applications for the back-end callable flows."
          }
        ]
      },
      "helpLinks":{
        "_helpLinksComment":"Helplinks that have a type:web attribute are rendered as web links. Otherwise, links are assumed to be to embedded Help topics in the Knowledge Center.",
        "title":"Find out more",
        "details":[
          {
            "title":"Knowledge Center link to ",
            "description":"Developing integration solutions by using applications",
            "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.etools.mft.doc/bi12002_.htm",
            "type":"web"
          }
        ]
      }
    },
    "pageSteps":{
      "create":{
        "overview":{
          "name":"Create",
          "heading":"Import projects",
          "_createComment":"A description of what will happen when the user clicks Import.",
          "sections":[
            {
              "section":"When you click Import, one REST API and two applications will be created in your workspace:"
            },
            {
              "section":"The REST API <span class='application'>AggregationCallableAsync</span> provides a single GET operation on a resource named AggregationResponse. The subflow representation of the operation, <span class='application'>getAggregatedResponse.subflow</span>, uses CallableFlowAsyncInvoke nodes to fan-out two requests. Two CallableFlowAsyncResponse nodes are used to fan-in reply messages from the back-end message flows."
            },
            {
              "section":"The Application <span class='application'>AggregationCallableAsyncBackend1</span> provides a single message flow with CallableInput, Mapping and CallableReply nodes."
            },
            {
              "section":"The Application <span class='application'>AggregationCallableAsyncBackend2</span> provides a single message flow with CallableInput, Mapping and CallableReply nodes."
            },
            {
              "section":"For simplicity, the REST API and two back-end applications can all be deployed to the same integration server. If you wish, you could deploy AggregationCallableAsyncBackend1 and AggregationCallableAsyncBackend2 to different integration servers (assuming you configure a Switch component to link the callable flows)."
            },
            {
              "section":"Once you import the tutorial, the provided applications are ready to be deployed and tested. Before you do this, you need to create the required MQ queues, as described on the Prepare tab."
            }
          ]
        },
        "helpLinks":{
          "title":"Find out more",
          "details":[
            {
              "title":"Knowledge Center link to ",
              "description":"Developing integration solutions by using applications",
              "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.etools.mft.doc/bi12002_.htm",
              "type":"web"
            }
          ]
        },
        "actions":{
          "title":"Create Actions",
          "details":[
            {
              "name":"Import",
              "method":"importArtifacts()"
            }
          ]
        }
      },
      "prepare":{
        "overview":{
          "name":"Prepare",
          "heading":"Create queues",
          "_prepareComment":"A description of what just happened when the user clicked Import, and what will happen when the user clicks Deploy.",
          "sections":[
            {
              "section":"Although this solution uses Callable Flows to route messages between the REST API and applications, the aggregation nodes require MQ queues to operate.",
              "steps":{
                "type":"ordered",
                "details":[
                  {
                    "details":"Create the default App Connect Enterprise queues in IBM MQ by completing the following steps:",
                    "substeps":{
                      "type":"ordered",
                      "details":[
                        {
                          "details":"Open the IBM App Connect Enterprise Console. If you don't already have one, create and start a queue manager:<br><code><span class='cmdname'>crtmqm</span> <span class='varname'> qmgr</span></code><br><code><span class='cmdname'>strmqm</span> <span class='varname'> qmgr</span></code>"
                        },
                        {
                          "details":"Next create the queues by typing the following command:<br><code>server\\sample\\wmq\\iib_createqueues <span class='varname'>qmgr</span></code><br>where<br><span class='varname'>qmgr</span> is the queue manager name."
                        }
                      ]
                    }
                  },
                  {
                    "details":"Create an integration node which is associated with the above queue manager by completing the following steps:",
                    "substeps":{
                      "type":"ordered",
                      "details":[
                        {
                          "details":"In the console window, create an integration node by typing the following command:<br><code><span class='cmdname'>mqsicreatebroker</span> <span class='varname'>TESTNODE</span> -q <span class='varname'>qmgr</span></code>"
                        },
                        {
                          "details":"Start the integration node by typing the following command:<br><code><span class='cmdname'>mqsistart</span> <span class='varname'>TESTNODE</span></code>"
                        },
                        {
                          "details":"Create an integration server associated with the integration node by typing the following command:<br><code><span class='cmdname'>mqsicreateexecutiongroup</span> <span class='varname'>TESTNODE</span> -e <span class='varname'>default</span></code>"
                        }
                      ]
                    }
                  }
                ]
              }
            }
          ]
        },
        "helpLinks":{
          
        }
      },
      "run":{
        "overview":{
          "name":"Run",
          "heading":"",
          "_runComment":"The full steps for the user to run through the tutorial. Use 'sections' to render paragraphs, 'steps' with a type of 'ordered' or 'unordered' to render HTML lists, and 'substeps' to render nested lists.",
          "sections":[
            {
              "section":"<h4>Deploy the back-end Callable Flow Applications</h4>",
              "steps":{
                "type":"ordered",
                "details":[
                  {
                    "details":"Deploy the <span class='application'>AggregationCallableAsyncBackend1</span> application, by dragging and dropping it on to the default integration server."
                  },
                  {
                    "details":"Deploy the <span class='application'>AggregationCallableAsyncBackend2</span> application, by dragging and dropping it on to the default integration server."
                  }
                ]
              }
            },
            {
              "section":"<h4>Use any web browser to simply test the REST API",
              "steps":{
                "type":"ordered",
                "details":[
                  {
                    "details":"Look inside the <span class='resource'>AggregationCallableAsync</span> REST API, right-click the <span class='resource'>AggregationCallableAsync.msgflow</span> and select <span class='resource'>Open with > Message Flow Editor</span>.",
                    "substeps":{
                      "type":"unordered",
                      "details":[
                        {
                          "details":"Click the Flow Exerciser icon <img src='https://ot4i.github.io/ot4i.tutorials//dist/images/icons/iib/startFlowExerciser.png' alt='' /> to start testing the flow"
                        }
                      ]
                    }
                  },
                  {
                    "details":"Open any web browser. We will be using this to send an HTTP GET into the REST API <span class='resource'>AggregationCallableAsync</span>.",
                    "substeps":{
                      "type":"unordered",
                      "details":[
                        {
                          "details":"In the address bar of the browser paste in the URL for the HTTP GET operation. If you have used default settings, then this is likely to be:"
                        },
                        {
                          "details":"http://localhost:7080/aggregationcallableasync/v1/AggregatedResponse?Field1=value1&Field2=value2"
                        },
                        {
                          "details":"Note that this URL includes query parameters with the values <span class='resource'>value1</span> and <span class='resource'>value2</span>. One of these values will be sent to each back-end flow. The back end flows will uppercase the values and reply."
                        }
                      ]
                    }
                  },
                  {
                    "details":"Return to <span class='resource'>AggregationCallableAsync.msgflow</span>.",
                    "substeps":{
                      "type":"unordered",
                      "details":[
                        {
                          "details":"Click the View Path icon <img src='https://ot4i.github.io/ot4i.tutorials//dist/images/icons/iib/viewPath.png' alt='' /> to see the path which the message took through the flow and see the message content on the path. You can open the subflow <span class='resource'>getAggregatedResponse.subflow</span> and click on the flow connections to see what the message tree looked like as it traversed through the REST API."
                        },
                        {
                          "details":"Back in the web browser, you should see the final output message carries return data from both of the back-end callable message flows which has been changed to upper case. It should look like this:"
                        },
                        {
                          "details":"<span class='resource'>{&quot;ResponseBackend1&quot;:&quot;VALUE1&quot;,&quot;ResponseBackend2&quot;:&quot;VALUE2&quot;}</span>"
                        }
                      ]
                    }
                  }
                ]
              }
            },
            {
              "section":"This tutorial has shown the Aggregation nodes orchestrating an asynchronous fan-out and an associated fan-in of messages to Callable Flows."
            }
          ]
        },
        "helpLinks":{
          "title":"Find out more",
          "details":[
            {
              "title":"Knowledge Center link to ",
              "description":"Message Flow Aggregation",
              "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.etools.mft.doc/ac00660_.htm",
              "type":"web"
            }
          ]
        }
      }
    }
  }
}