{
  "version":"0.6",
  "pageContent":{
    "_comments":"JSON object that contains data for page labels, buttons, etc.",
    "navItems":{
      "_common":{
        "buttonBackToGallery":{
          "name":"Back To Gallery",
          "method":"backToGallery()",
          "idName":"backToGallery"
        },
        "buttonStartTutorial":{
          "name":"Start Tutorial",
          "method":"startTutorialFromDetailsScreen()",
          "idName":"startTutorial"
        },
        "buttonViewDetails":{
          "name":"View Details",
          "method":"viewDetails()",
          "idName":"stepsViewDetails"
        }
      }
    }
  },
  "tutorial":{
    "_common":{
      "name":"Getting started with ACEv12 - Policy Projects and Policies with Overrides",
      "shortDescription":"Learn about configuring ACE behavior using Policies and the hierarchy of policy overrides",
      "durationText":"This tutorial takes approximately",
      "durationTime":"5 minutes",
      "_resourceToOpenComment":"The ID of the first resource to open when the user imports the tutorial. Resource IDs are defined in the repo_metadata.json Tutorials listing on ot4i.",
      "resourceToOpen":"SimpleFlow",
      "helpLink":{
        "text":"IBM Knowledge Center",
        "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.ace.home.doc/help_home.htm"
      }
    },
    "pageDetails":{
      "topicsName":"Tutorial Topics",
      "_topicListComment":"A short list of product concepts or tasks demonstrated by this tutorial",
      "topicList":[
        {
          "title":"Creating a Policy Project and a simple Policy"
        },
        {
          "title":"Deploying policies in a BAR file"
        },
        {
          "title":"Overriding behavior by copying policies directlty on to the runtime file system"
        }
      ],
      "outcomesName":"Learning outcomes",
      "_outcomesComment":"Learn how to use Integration Servers effectively in ACE v11",
      "outcomeList":[
        {
          "title":"Understand the use of policies in ACEv11"
        },
        {
          "title":"Understand the hierarchy of policy overrides and the concept of a default policy project"
        }
      ],
      "summary":{
        "overviewName":"OVERVIEW",
        "_overviewComment":"A short description of what happens in this tutorial, and an optional short explanation of the IIB concepts used in this tutorial if necessary for context. What background knowledge must the user have for this to make sense?",
        "sections":[
          {
            "section":"App Connect Enterprise v11 introduces the concept of a Policy Project which can be created in the Toolkit, and is used to hold one or more policies. Policies are used to control connection properties and operational properties which are required by the ACE runtime."
          },
          {
            "section":"A policy can be used to provide values which override the properties of message flow nodes. This is helpful for properties which are likely to differ across different runtime environments such as Dev / Test / Production as it avoids having to change the message flow itself when promoting it between environments."
          },
          {
            "section":"A policy can be used to abstract the definition of message flow node properties which may include sensitive data that a developer (unlike an administrator) may not have access to."
          },
          {
            "section":"Policies can be used to provide global properties that have wider scope than a message flow node. For example, a user can define an Activity Log policy which defines the name of a file to which activity log records should be written."
          },
          {
            "section":"This tutorial uses a simple message flow which receives data over HTTP and sends an Email output. The EmailOutput message flow node is configured to use an SMTP Policy which is deployed using a BAR file. The tutorial demonstrates how to refer to the policy from the EMailOutput message flow node, how you can override policies, and the concept of a default policy project."
          }
        ]
      }
    },
    "pageSteps":{
      "create":{
        "overview":{
          "name":"Create",
          "heading":"Import an application and create a policy project with an SMTP policy",
          "_createComment":"A description of what will happen when the user clicks Import.",
          "sections":[
            {
              "section":"",
              "steps":{
                "type":"ordered",
                "details":[
                  {
                    "details":"Click  <span class='uicontrol'>Import</span> and the <span class='uicontrol'>HTTPInputEmailOutput</span> application will be imported into your workspace."
                  },
                  {
                    "details":"Open the HTTPInputEmailOutput message flow and look at the EmailOutput node's properties. Note that the Basic property tab has a property named <span class='uicontrol'>SMTP Server and Port</span> which addresses <code>{MyPolicyProject}:MySMTPPolicy</code>"
                  },
                  {
                    "details":"On the Email property tab, note that the property named <span class='uicontrol'>To Addresses</span> specifies a value of <code>anyobscurenameyouwant@mailinator.com</code>. You can optionally change this if you want. This is the email address to which an email will be sent (from your SMTP email provider)"
                  },
                  {
                    "details":"On the Email property tab, change the property named <span class='uicontrol'>From Address</span> to be your email address from which you intend the email to be sent (when ACE connects to your SMTP server)"
                  },
                  {
                    "details":"Create a Policy project named <span class='uicontrol'>MyPolicyProject</span> using the New link in the top right corner of the Application Development view."
                  },
                  {
                    "details":"Create a Policy named <span class='uicontrol'>MySMTPPolicy</span> of type SMTP (click the New link which appeared inside the empty project you just created).  Set the <span class='uicontrol'>SMTP server name</span> to be your SMTP server. For example, smtp.hursley.ibm.com:25 Set the <span class='uicontrol'>Security identity</span> to be the hardcoded string <code>GoodIdentity</code> (this value will be mapped to your actual identity using the mqsisetdbparms command in the later steps)"
                  }
                ]
              }
            }
          ]
        },
        "actions":{
          "title":"Create Actions",
          "details":[
            {
              "name":"Import",
              "method":"importArtifacts()"
            }
          ]
        }
      },
      "prepare":{
        "overview":{
          "name":"Prepare",
          "heading":"Create and Configure an Integration Server",
          "_prepareComment":"Creating an IntegrationServer:",
          "sections":[
            {
              "section":"",
              "steps":{
                "type":"ordered",
                "details":[
                  {
                    "details":"Open an App Connect Enterprise Command Console and run the mqsicreateworkdir command to prepare a work directory for an integration server:<br><ul><li>If you are using a Windows platform: <code>mqsicreateworkdir C:\\MyServer</code></li><li>If you are using a UNIX platform: <code>mqsicreateworkdir /home/exampleuser/MyServer</li></ul>"
                  },
                  {
                    "details":"Run the mqsisetdbparms command to define the identity which ACE will use when communicating with your SMTP server:<br><ul><li>If you are using a Windows platform: <code>mqsisetdbparms -w C:\\MyServer -n smtp::GoodIdentity -u YourSMTPUserId -p YourSMTPPassword</code><br>where <b>C:\\MyServer</b> is a folder on your file system, created in the command above, that the server will use for its working directory.</li><li>If you are using a UNIX platform: <code>mqsisetdbparms -w /home/exampleuser/MyServer -n smtp::GoodIdentity -u YourSMTPUserId -p YourSMTPPassword</code><br>where <b>/home/exampleuser/MyServer</b> is a folder on your file system, created in the command above, that the server will use for its working directory.</li></ul>"
                  },
                  {
                    "details":"Now, start the integration server using the following command:<br><ul><li>If you are using a Windows platform: <code>IntegrationServer --work-dir C:\\MyServer --name MyServer --admin-rest-api 7600 --http-port-number 7900 --console-log</code></li><li>If you are using a UNIX platform: <code>IntegrationServer --work-dir /home/exampleuser/MyServer --name MyServer --admin-rest-api 7600 --http-port-number 7900 --console-log</code></li></ul>"
                  },
                  {
                    "details":"After a few seconds the server should report that it has finished initialization and that its HTTP Listener has started listening for connections."
                  }
                ]
              }
            }
          ]
        }
      },
      "run":{
        "overview":{
          "name":"Run",
          "heading":"Run three separate examples to demonstrate policy identification and overrides",
          "_runComment":"The full steps for the user to run through the tutorial. Use 'sections' to render paragraphs, 'steps' with a type of 'ordered' or 'unordered' to render HTML lists, and 'substeps' to render nested lists.",
          "sections":[
            {
              "section":"<b>Learn how the {PolicyProject}:Policy syntax can address a deployed policy</b>",
              "steps":{
                "type":"ordered",
                "details":[
                  {
                    "details":"In the App Connect Enterprise Toolkit, connect to your Integration Server <span class='uicontrol'>MyServer</span> on localhost:7600. Create a Broker Archive file, for example named <span class='uicontrol'>HTTPInputEmailOutput.bar</span> inside the <span class='uicontrol'>HTTPInputEmailOutput</span> application project which you imported earlier.  Once you have created the BAR file, you need to add to it both the <span class='uicontrol'>HTTPInputEmailOutput</span> application and the <span class='uicontrol'>MyPolicyProject</span> policy project. Remember to click the <span class='uicontrol'>Build and Save</span> button on the BAR editor's prepare tab."
                  },
                  {
                    "details":"Drag and drop deploy the <span class='uicontrol'>HTTPInputEmailOutput.bar</span> BAR file onto <span class='uicontrol'>MyServer</span>."
                  },
                  {
                    "details":"Test the message flow by sending HTTP data to it using a client such as cURL: <br><code>curl -X POST http://localhost:7900/HTTPInputEmailOutput -d HelloWorld</code><br>"
                  },
                  {
                    "details":"The message flow should echo back the same message to the HTTP client, but you should find that the flow's email Output node has successfully found the SMTP policy you deployed, which in turn used the abstracted userid and password which was defined using mqsisetdbparms, and an email will have been successfully sent. Check this is the case. If you are using mailinator for this purpose, you can open the public mailbox using a web browser and a URL like this:<br><code>http://www.mailinator.com/v2/inbox.jsp?zone=public&query=anyobscurenameyouwant</code>"
                  }
                ]
              }
            },
            {
              "section":"<b>Learn how unqualified policy names won't be resolved, if you haven't defined a default policy project</b>",
              "steps":{
                "type":"ordered",
                "details":[
                  {
                    "details":"Delete all resources which have previously been deployed. Open the HTTPInputEmailOutput message flow and on the EmailOutput node's Basic property tab edit the property named <span class='uicontrol'>SMTP Server and Port</span> to take the value <code>MySMTPPolicy</code> (so it is no longer qualified by the name of the policy project)."
                  },
                  {
                    "details":"Open the  <span class='uicontrol'>HTTPInputEmailOutput.bar</span> BAR file and click the <span class='uicontrol'>Build and Save</span> button on the BAR editor's prepare tab. Drag and drop deploy the updated BAR file."
                  },
                  {
                    "details":"Repeat the test of the message flow by sending HTTP data to it using a client such as cURL, and this time you will note that an exception is reported in the command console window where the IntegrationServer is running. This exception occurs because having deleted the Policy Project qualifier, the EmailOutput node's policy can no longer be located. In this circumstance, the <span class='uicontrol'>SMTP Server and Port</span> property has been interpreted as a literal hard-coded SMTP server hostname, which of course cannot be connected to."
                  }
                ]
              }
            },
            {
              "section":"<b>Learn how unqualified policy names will be resolved, if you have defined a default policy project</b>",
              "steps":{
                "type":"ordered",
                "details":[
                  {
                    "details":"Delete all resources which have previously been deployed and then stop the Integration Server using CTRL-C in the command console window where it is running."
                  },
                  {
                    "details":"Look inside your integration server's work directory on the file system (at <code>C:\\MyServer</code> on Windows and at <code>/home/exampleuser/MyServer</code> on UNIX) and edit the <code>server.conf.yaml</code> file. Find this line:<br><code>  #policyProject: 'DefaultPolicies'   # Name of the Policy project that will be used for unqualified Policy references</code><br>... and change it to become ...<br><code>  policyProject: 'MyPolicyProject'   # Name of the Policy project that will be used for unqualified Policy references </code>"
                  },
                  {
                    "details":"From your App Connect Enterprise Toolkit's workspace directory on the file system, copy the <code>MyPolicyProject</code> project (which is a directory on your file system) into your Integration Server's overrides directory. If you have followed this tutorial's suggested naming conventions then this directory will end up at <code>C:\\MyTestServer\\overrides\\MyPolicyProject</code> on Windows and at <code>/home/exampleuser/MyServer/overrides/MyPolicyProject</code> on UNIX. Restart your integration server."
                  },
                  {
                    "details":"Back in the App Connect Enterprise Toolkit, create a new BAR file, for example named  <span class='uicontrol'>HTTPInputEmailOutput2.bar</span>, and build it to <strong>just</strong> contain the application <span class='uicontrol'>HTTPInputEmailOutput</span> and NOT the policy project   <span class='uicontrol'>MyPolicyProject</span>. Deploy the new BAR file."
                  },
                  {
                    "details":"Retest the message flow using cURL just as you have done before and note that it will now send the email again successfully. This has demonstrated the fact that on message flow node properties, App Connect Enterprise will look for unqualified policies in the default policy project which you can configure for your server using the server.conf.yaml file."
                  }
                ]
              }
            }
          ]
        }
      }
    }
  }
}
