{
  "version":"0.1",
  "pageContent":{
    "_comments":"object that contains data for page labels, buttons, etc.",
    "navItems":{
      "_common":{
        "buttonBackToGallery":{
          "name":"Back To Gallery",
          "method":"backToGallery()",
          "idName":"backToGallery"
        },
        "buttonStartTutorial":{
          "name":"Start Tutorial",
          "method":"startTutorialFromDetailsScreen()",
          "idName":"startTutorial"
        },
        "buttonViewDetails":{
          "name":"View Details",
          "method":"viewDetails()",
          "idName":"stepsViewDetails"
        }
      }
    }
  },
  "tutorial":{
    "_common":{
      "name":"Using a FlowOrder node to control the order of execution paths in a flow",
      "shortDescription":"Learn how to use the FlowOrder node to control the order of execution paths in a message flow driven by a JSON message over HTTP.",
      "durationText":"This tutorial takes approximately",
      "durationTime":"10 minutes",
      "_resourceToOpenComment":"The ID of the first resource to open when the user imports the tutorial. Resource IDs are defined in the repo_metadata.json Tutorials listing on ot4i.",
      "resourceToOpen":"MainFlow",
      "helpLink":{
        "text":"IBM Knowledge Center",
        "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.ace.home.doc/help_home.htm"
      }
    },
    "pageDetails":{
      "topicsName":"Tutorial Topics",
      "_topicListComment":"A short list of product concepts or tasks demonstrated by this tutorial",
      "topicList":[
        {
          "title":"FlowOrder node"
        }
      ],
      "outcomesName":"Learning outcomes",
      "_outcomesComment":"A description of what the user will have learned or accomplished by running this tutorial.",
      "outcomeList":[
        {
          "title":"Use IBM App Connect Enterprise to control the order of execution in a message flow."
        }
      ],
      "summary":{
        "overviewName":"OVERVIEW",
        "_overviewComment":"A short description of what happens in this tutorial, and an optional short explanation of the ACE concepts used in this tutorial if necessary for context. What background knowledge must the user have for this to make sense?",
        "sections":[
          {
            "section":"This tutorial demonstrates a simple message flow that receives a JSON input message over HTTP, which contains a single data field with mixed case data. Two separate HTTPInput nodes, which are triggered using different input URLs, are used to start the flow. These inputs drive two separate paths through the flow which contrast the use of a FlowOrder node to control the order of execution paths with the random ordering which occurs if two wires are connected from the same output terminal of a node."
          },
          {
            "section":"The tutorial requires an ACE integration node owned server, or a standalone server."
          },
          {
            "section":"In IBM App Connect Enterprise, an application is a container for all the resources that are required to create a solution. This tutorial provides an application to hold the message flow. There are no other pre-requisites needed by the scenario."
          }
        ]
      },
      "helpLinks":{
        "_helpLinksComment":"Helplinks that have a type:web attribute are rendered as web links. Otherwise, links are assumed to be to embedded Help topics in the Knowledge Center.",
        "title":"Find out more",
        "details":[
          {
            "title":"Knowledge Center link to ",
            "description":"Developing integration solutions by using applications",
            "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.etools.mft.doc/bi12002_.htm",
            "type":"web"
          }
        ]
      }
    },
    "pageSteps":{
      "create":{
        "overview":{
          "name":"Create",
          "heading":"Import projects",
          "_createComment":"A description of what will happen when the user clicks Import.",
          "sections":[
            {
              "section":"When you click Import, one project will be created in your workspace: An application named <span class='application'>ExampleFlowOrder</span>."
            },
            {
              "section":"<span class='application'>ExampleFlowOrder</span> provides a single message flow named <span class='resource'>FlowOrder</span> which provides two separate HTTPInput nodes as entry points to the flow. Both branches of the flow start by tracing the input with a Trace node and then use an HTTPReply to reply to the requestor."
            },
            {
              "section":"The <span class='resource'>/FlowOrder</span> branch of the flow then uses a FlowOrder node to execute two separate maps - the first one to lowercase the message data and the second one to uppercase the message data. Trace information is written to an output file."
            },
            {
              "section":"The <span class='resource'>/RandomOrder</span> branch of the flow does not control the order of execution of the two separate maps, so the user has no control over whether the message data is first converted to lowercase and then uppercase or vice versa. Trace information is written to an output file."
            },
            {
              "section":"Once imported using the link on the right, the provided project is ready to be deployed and tested. To deploy, you can use a provided BAR file, as described on the Prepare tab."
            }
          ]
        },
        "helpLinks":{
          "title":"Find out more",
          "details":[
            {
              "title":"Knowledge Center link to ",
              "description":"Developing integration solutions by using applications",
              "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.etools.mft.doc/bi12002_.htm",
              "type":"web"
            }
          ]
        },
        "actions":{
          "title":"Create Actions",
          "details":[
            {
              "name":"Import",
              "method":"importArtifacts()"
            }
          ]
        }
      },
      "prepare":{
        "overview":{
          "name":"Prepare",
          "heading":"Prepare a trace directory, create an integration node and deploy the message flow",
          "_prepareComment":"A description of what just happened when the user clicked Import, and what will happen when the user clicks Deploy.",
          "sections":[
            {
              "section":"Prepare the scenario by executing the following steps:",
              "steps":{
                "type":"ordered",
                "details":[
                  {
                    "details":"The message flow's Trace node will attempt to write a trace file to the directory <code><span class='cmdname'>C:\\temp</span></code>. Create this directory if it does not already exist, or edit the Trace node in the message flow to use a different directory suitable for your runtime environment."
                  },
                  {
                    "details":"Next, create an integration node by starting an App Connect Enterprise command console and executing the following commands:<br><code><span class='cmdname'>mqsicreatebroker TESTNODE</span></code><br><code><span class='cmdname'>mqsistart TESTNODE</span></code><br><code><span class='cmdname'>mqsicreateexecutiongroup TESTNODE -e server</span></code>"
                  },
                  {
                    "details":"Back in the Toolkit, drag and drop deploy the provided BAR file named <span class='application'>FlowOrder.bar</span> which you will find inside the <span class='application'>ExampleFlowOrder</span> application."
                  }
                ]
              }
            }
          ]
        },
        "helpLinks":{
          
        }
      },
      "run":{
        "overview":{
          "name":"Run",
          "heading":"",
          "_runComment":"The full steps for the user to run through the tutorial. Use 'sections' to render paragraphs, 'steps' with a type of 'ordered' or 'unordered' to render HTML lists, and 'substeps' to render nested lists.",
          "sections":[
            {
              "section":"<h4>Use the Flow Exerciser to test the tutorial scenario",
              "steps":{
                "type":"ordered",
                "details":[
                  {
                    "details":"Open <span class='resource'>FlowOrder.msgflow</span>.",
                    "substeps":{
                      "type":"unordered",
                      "details":[
                        {
                          "details":"Click the Flow Exerciser icon <img src='http://ot4i.github.io/ot4i.tutorials//dist/images/icons/iib/startFlowExerciser.png' alt='' /> to start testing the flow (when challenged you do not need to redeploy the flow again)."
                        },
                        {
                          "details":"Click the Send Message icon <img src='http://ot4i.github.io/ot4i.tutorials/dist/images/icons/iib/sendMessage.png' alt='' />."
                        },
                        {
                          "details":"Two saved messages are provided so you can execute both branches of the flow and compare the results. Each message provides the same input JSON message which contains mixed case data. To try out the FlowOrder branch select the input message <span class='resource'>FlowOrder</span>. Try out the RandomOrder branch, select the input message <span class='resource'>RandomOrder</span>. Click Send and your message is sent to the HTTPInput node."
                        },
                        {
                          "details":"Both <span class='resource'>FlowOrder</span> and <span class='resource'>RandomOrder</span> contain this data:<br><span class='resource'>{\"message\":\"This is a MiXeD case message\"}</span>"
                        },
                        {
                          "details":"After you close the dialog, the path taken through the messageflow is highlighted. Using a text editor, open the trace file <span class='resource'>C:\\temp\\TraceFlowOrder.txt</span>. If you executed the FlowOrder branch, the trace file should read like this:<br><code>2019-08-02 17:08:38.802437 = The FlowOrder path has been invoked ...</code><br><code>2019-08-02 17:08:38.806927 = The message tree is set to: 'this is a mixed case message'</code><br><code>2019-08-02 17:08:38.808863 = The message tree is set to: 'THIS IS A MIXED CASE MESSAGE'</code><br>If you executed the RandomOrder branch, then the trace file entries may or may not be the other way around(!)"
                        }
                      ]
                    }
                  }
                ]
              }
            },
            {
              "section":"This tutorial has shown the FlowOrder node control the order of execution paths in a flow."
            }
          ]
        },
        "helpLinks":{
          "title":"Find out more",
          "details":[
            {
              "title":"Knowledge Center link to ",
              "description":"FlowOrder node",
              "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.etools.mft.doc/ac04790_.htm",
              "type":"web"
            },
            {
              "title":"Knowledge Center link to ",
              "description":"Testing your message flow by using the Flow exerciser",
              "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.etools.mft.doc/rt26110_.htm",
              "type":"web"
            }
          ]
        }
      }
    }
  }
}