{
  "version":"0.1",
  "pageContent":{
    "_comments":"object that contains data for page labels, buttons, etc.",
    "navItems":{
      "_common":{
        "buttonBackToGallery":{
          "name":"Back To Gallery",
          "method":"backToGallery()",
          "idName":"backToGallery"
        },
        "buttonStartTutorial":{
          "name":"Start Tutorial",
          "method":"startTutorialFromDetailsScreen()",
          "idName":"startTutorial"
        },
        "buttonViewDetails":{
          "name":"View Details",
          "method":"viewDetails()",
          "idName":"stepsViewDetails"
        }
      }
    }
  },
  "tutorial":{
    "_common":{
      "name":"Using a Timeout Notification node to automatically start a flow",
      "shortDescription":"Learn how to use the Timeout Notification node to automatically start a flow after a regular configurable time interval.",
      "durationText":"This tutorial takes approximately",
      "durationTime":"10 minutes",
      "_resourceToOpenComment":"The ID of the first resource to open when the user imports the tutorial. Resource IDs are defined in the repo_metadata.json Tutorials listing on ot4i.",
      "resourceToOpen":"MainFlow",
      "helpLink":{
        "text":"IBM Knowledge Center",
        "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.ace.home.doc/help_home.htm"
      }
    },
    "pageDetails":{
      "topicsName":"Tutorial Topics",
      "_topicListComment":"A short list of product concepts or tasks demonstrated by this tutorial",
      "topicList":[
        {
          "title":"Timeout Notification node"
        }
      ],
      "outcomesName":"Learning outcomes",
      "_outcomesComment":"A description of what the user will have learned or accomplished by running this tutorial.",
      "outcomeList":[
        {
          "title":"Use IBM App Connect Enterprise to control the execution of a message flow on a timed basis."
        }
      ],
      "summary":{
        "overviewName":"OVERVIEW",
        "_overviewComment":"A short description of what happens in this tutorial, and an optional short explanation of the ACE concepts used in this tutorial if necessary for context. What background knowledge must the user have for this to make sense?",
        "sections":[
          {
            "section":"This tutorial demonstrates a very simple message flow that only contains two message flow nodes. The flow is started using a Timeout Notification node which is configured to fire a flow propagation on an automatic regular basis after a fixed interval of time. The second node in the flow is a trace node which appends text to a trace file to record the time when the trace node was reached, the interval for flow propagation and the message count. After observing the flow in operation, the tutorial reconfigures the flow to use a Policy which defines the configuration of the time period interval between the flow propagations. Policies can be referred to from one or more flows, and redeployed to reconfigure the behavior of the flow."
          },
          {
            "section":"The tutorial requires an ACE integration node owned server, or a standalone server."
          },
          {
            "section":"In IBM App Connect Enterprise, an application is a container for all the resources that are required to create a solution. This tutorial provides an application to hold the message flow. This scenario uses the Timeout Notification node which requires your integration node or server to be associated with a local queue manager, so an MQ installation is required. There are no other pre-requisites needed by the scenario."
          }
        ]
      },
      "helpLinks":{
        "_helpLinksComment":"Helplinks that have a type:web attribute are rendered as web links. Otherwise, links are assumed to be to embedded Help topics in the Knowledge Center.",
        "title":"Find out more",
        "details":[
          {
            "title":"Knowledge Center link to ",
            "description":"Developing integration solutions by using applications",
            "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.etools.mft.doc/bi12002_.htm",
            "type":"web"
          }
        ]
      }
    },
    "pageSteps":{
      "create":{
        "overview":{
          "name":"Create",
          "heading":"Import projects",
          "_createComment":"A description of what will happen when the user clicks Import.",
          "sections":[
            {
              "section":"When you click Import, two projects will be created in your workspace: An application named <span class='application'>ExampleTimeoutNotification</span> and a policy project named <span class='application'>myPols</span>."
            },
            {
              "section":"<span class='application'>ExampleTimeoutNotification</span> provides a single message flow named <span class='resource'>TimeoutNotification</span>. The flow is started using a Timeout Notification node which is configured to fire a flow propagation on an automatic regular basis every 20 seconds. The second node in the flow is a trace node which appends text to a trace file which records the time when the trace node was reached, the interval for flow propagation and the message count."
            },
            {
              "section":"<span class='application'>myPols</span> is a policy project holding a single policy named <span class='resource'>T1</span>. The policy won't be used to start with, but is provided ready for the extension to the basic scenario which is described on the Run tab."
            },
            {
              "section":"Once imported using the link on the right, the application <span class='application'>ExampleTimeoutNotification</span> is ready to be deployed and tested. To deploy, you can use a provided BAR file, as described on the Prepare tab."
            }
          ]
        },
        "helpLinks":{
          "title":"Find out more",
          "details":[
            {
              "title":"Knowledge Center link to ",
              "description":"Developing integration solutions by using applications",
              "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.etools.mft.doc/bi12002_.htm",
              "type":"web"
            }
          ]
        },
        "actions":{
          "title":"Create Actions",
          "details":[
            {
              "name":"Import",
              "method":"importArtifacts()"
            }
          ]
        }
      },
      "prepare":{
        "overview":{
          "name":"Prepare",
          "heading":"Prepare a trace directory, create a queue manager and integration node, and then deploy the message flow",
          "_prepareComment":"A description of what just happened when the user clicked Import, and what will happen when the user clicks Deploy.",
          "sections":[
            {
              "section":"The Trace node uses a trace directory and the Timeout Notification node requires MQ queues to operate, so execute the following steps to prepare your environment accordingly:",
              "steps":{
                "type":"ordered",
                "details":[
                  {
                    "details":"The message flow's Trace node will attempt to write a trace file to the directory <code><span class='cmdname'>C:\\temp</span></code>. Create this directory if it does not already exist, or edit the Trace node in the message flow to use a different directory suitable for your runtime environment."
                  },
                  {
                    "details":"Create the default App Connect Enterprise queues in IBM MQ by completing the following steps:",
                    "substeps":{
                      "type":"ordered",
                      "details":[
                        {
                          "details":"Open the IBM App Connect Enterprise Console. If you don't already have one, create and start a queue manager:<br><code><span class='cmdname'>crtmqm</span> <span class='varname'> qmgr</span></code><br><code><span class='cmdname'>strmqm</span> <span class='varname'> qmgr</span></code>"
                        },
                        {
                          "details":"Next create the queues by typing the following command:<br><code>server\\sample\\wmq\\iib_createqueues <span class='varname'>qmgr</span></code><br>where<br><span class='varname'>qmgr</span> is the queue manager name."
                        }
                      ]
                    }
                  },
                  {
                    "details":"Create an integration node which is associated with the above queue manager by completing the following steps:",
                    "substeps":{
                      "type":"ordered",
                      "details":[
                        {
                          "details":"In the console window, create an integration node by typing the following command:<br><code><span class='cmdname'>mqsicreatebroker</span> <span class='varname'>TESTNODE</span> -q <span class='varname'>qmgr</span></code>"
                        },
                        {
                          "details":"Start the integration node by typing the following command:<br><code><span class='cmdname'>mqsistart</span> <span class='varname'>TESTNODE</span></code>"
                        },
                        {
                          "details":"Create an integration server associated with the integration node by typing the following command:<br><code><span class='cmdname'>mqsicreateexecutiongroup</span> <span class='varname'>TESTNODE</span> -e <span class='varname'>default</span></code>"
                        }
                      ]
                    }
                  },
                  {
                    "details":"Back in the Toolkit, drag and drop deploy the provided BAR file named <span class='application'>TimeoutNotification.bar</span> which you will find inside the <span class='application'>ExampleTimeoutNotification</span> application."
                  }
                ]
              }
            }
          ]
        },
        "helpLinks":{
          
        }
      },
      "run":{
        "overview":{
          "name":"Run",
          "heading":"",
          "_runComment":"The full steps for the user to run through the tutorial. Use 'sections' to render paragraphs, 'steps' with a type of 'ordered' or 'unordered' to render HTML lists, and 'substeps' to render nested lists.",
          "sections":[
            {
              "section":"<h4>Use the Flow Exerciser to test the tutorial scenario",
              "steps":{
                "type":"ordered",
                "details":[
                  {
                    "details":"Open <span class='resource'>TimeoutNotification.msgflow</span>.",
                    "substeps":{
                      "type":"unordered",
                      "details":[
                        {
                          "details":"Click the Flow Exerciser icon <img src='http://ot4i.github.io/ot4i.tutorials//dist/images/icons/iib/startFlowExerciser.png' alt='' /> to start testing the flow (when challenged you do not need to redeploy the flow again)."
                        },
                        {
                          "details":"This flow does not need you to send it a message to drive it. Simply wait for about 20 seconds for a flow propagation to occur. If you are impatient, you can check the trace directory which was configured on the Prepare tab for the presence of the trace file named <code><span class='cmdname'>TraceTimeoutNotification.txt</span></code>. Once the flow has fired, the trace node should contain an entry that looks like this:<br><code>The flow propagation is from the Timeout Notification node with count number 1</code><br><code>The flow propagation has reached the Trace node at 2019-08-04 20:18:56.974640</code><br><code>The flow was started by Timeout Notification node with the identifier 'ID1'</code><br><code>The flow Timeout Notification node currently has its interval set to 20 seconds</code><br>"
                        },
                        {
                          "details":"After you close the dialog, the path taken through the messageflow is highlighted. Using a text editor, open the trace file <span class='resource'>C:\\temp\\TraceTimeoutNotification.txt</span>."
                        },
                        {
                          "details":"Next, reconfigure the TimeoutNotification node. Change the <span class='resource'>Unique Identifier</span> property to the value <span class='resource'>{myPols}:T1</span>. This means that the TimeoutNotification node will take its interval from the policy named <span class='resource'>T1</span> which resides in the policy project named <span class='resource'>myPols</span>. Drag and drop deploy the policy project named <span class='resource'>myPols</span>, and then drag and drop deploy the application <span class='application'>ExampleTimeoutNotification</span> (or do both these actions together by reconfiguring the <span class='application'>TimeoutNotification.bar</span> which you used earlier). The policy has been set up with the shorter interval of 5 seconds. You can experiment with different intervals by simply redeploying the policy project after updating the value of its property named <span class='resource'>Timeout (seconds)</span>."
                        }
                      ]
                    }
                  }
                ]
              }
            },
            {
              "section":"This tutorial has shown the Timeout Notification node automatically start a flow on a regular timed interval."
            }
          ]
        },
        "helpLinks":{
          "title":"Find out more",
          "details":[
            {
              "title":"Knowledge Center link to ",
              "description":"Timeout Notification node",
              "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.etools.mft.doc/ac20802_.htm",
              "type":"web"
            },
            {
              "title":"Knowledge Center link to ",
              "description":"Testing your message flow by using the Flow exerciser",
              "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.etools.mft.doc/rt26110_.htm",
              "type":"web"
            }
          ]
        }
      }
    }
  }
}