{
  "version":"0.6",
  "pageContent":{
    "_comments":"JSON object that contains data for page labels, buttons, etc.",
    "navItems":{
      "_common":{
        "buttonBackToGallery":{
          "name":"Back To Gallery",
          "method":"backToGallery()",
          "idName":"backToGallery"
        },
        "buttonStartTutorial":{
          "name":"Start Tutorial",
          "method":"startTutorialFromDetailsScreen()",
          "idName":"startTutorial"
        },
        "buttonViewDetails":{
          "name":"View Details",
          "method":"viewDetails()",
          "idName":"stepsViewDetails"
        }
      }
    }
  },
  "tutorial":{
    "_common":{
      "name":"Using a WorkLoad Management Policy to restrict the maximum throughput of a flow",
      "shortDescription":"Learn how to use a Workload Management Policy to control the throughput of a message flow.",
      "durationText":"This tutorial takes approximately",
      "durationTime":"15 minutes",
      "_resourceToOpenComment":"The ID of the first resource to open when the user imports the tutorial. Resource IDs are defined in the repo_metadata.json Tutorials listing on ot4i.",
      "resourceToOpen":"EventRoutingFlow",
      "helpLink":{
        "text":"IBM Knowledge Center",
        "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.ace.home.doc/help_home.htm"
      }
    },
    "pageDetails":{
      "topicsName":"Tutorial Topics",
      "_topicListComment":"A short list of product concepts or tasks demonstrated by this tutorial",
      "topicList":[
        {
          "title":"Workload Management Policies"
        }
      ],
      "outcomesName":"Learning outcomes",
      "_outcomesComment":"A description of what the user will have learned or accomplished by running this tutorial.",
      "outcomeList":[
        {
          "title":"Understand how to use a Workload Management Policy to limit the throughput of a Message Flow."
        }
      ],
      "summary":{
        "overviewName":"OVERVIEW",
        "_overviewComment":"A short description of what happens in this tutorial, and an optional short explanation of the ACE concepts used in this tutorial if necessary for context. What background knowledge must the user have for this to make sense?",
        "sections":[
          {
            "section":"This tutorial demonstrates how to use a Workload Management Policy to control the maximum throughput of a message flow. This use of a Workload Management Policy is particularly useful when backend systems that a message flow interacts with are unable to keep up with a workload sent from a requesting application."
          },
          {
            "section":"This tutorial provides a message flow that performs a simple transformation of an XML input message received over HTTP before sending a reply to the requesting application."
          },
          {
            "section":"If you are using Developer Edition, which restricts message processing to 1 message per second, or your system is unable to process messages through the flow at a rate that exceeds 1 message per second then you will not be able to observe the effects of attaching a Workload Management Policy that is demonstated by this tutorial."
          }
        ]
      },
      "helpLinks":{
        "_helpLinksComment":"Helplinks that have a type:web attribute are rendered as web links. Otherwise, links are assumed to be to embedded Help topics in the Knowledge Center.",
        "title":"Find out more",
        "details":[
          {
            "title":"Knowledge Center link to ",
            "description":"Developing integration solutions by using applications",
            "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.etools.mft.doc/bi12002_.htm",
            "type":"web"
          },
          {
            "title":"GitHub link to ",
            "description":"DFDL Schemas",
            "link":"http://github.com/DFDLSchemas",
            "type":"web"
          }
        ]
      }
    },
    "pageSteps":{
      "create":{
        "overview":{
          "name":"Create",
          "heading":"Import projects",
          "_createComment":"A description of what will happen when the user clicks Import.",
          "sections":[
            {
              "section":"Click <span class='uicontrol'>Import</span> to add the required projects to your workspace:",
              "steps":{
                "type":"ordered",
                "details":[
                  {
                    "name":"The application named <span class='application'>WorkloadManagementApplication</span> contains the following resources.",
                    "details":"The application named <span class='application'>WorkloadManagementApplication</span> contains the following resources.",
                    "substeps":{
                      "type":"unordered",
                      "details":[
                        {
                          "details":"A message flow named <span class='msgflow'>WorkloadManagementFlow</span> that receives an HTTP message, performs a simple transformation and then sends an HTTP reply."
                        },
                        {
                          "details":"An XML input message named <span class='resource'>TestMessage.xml</span> to test the message flow with."
                        },
                        {
                          "details":"A BAR File named <span class='resource'>wlm.bar</span> which contains <span class='application'>WorkloadManagementApplication</span>, which itself contains <span class='msgflow'>WorkloadManagementFlow</span>. The message flow has been configured to refer to the Workload Management policy (which is described below)."
                        }
                      ]
                    }
                  },
                  {
                    "details":"The policy project named <span class='application'>MyPolicies</span> contains a Workload Management Policy named <span class='application'>WLM_MaxRate_Policy</span>. To start with this policy defines a Maximum Rate (messages per second) of 100,000. Later in the tutorial we will show the impact of changing this threshold."
                  },
                  {
                    "details":"The two java projects named <span class='application'>PerfHarness</span> and <span class='application'>HTTPPerfHarness</span> jointly provide a testing capability which we will use to drive workload through the message flow."
                  }
                ]
              }
            }
          ]
        },
        "helpLinks":{
          "title":"Find out more",
          "details":[
            {
              "title":"Knowledge Center link to ",
              "description":"Workload management",
              "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.etools.mft.doc/bj58250_.htm",
              "type":"web"
            },
            {
              "title":"Knowledge Center link to ",
              "description":"Setting the maximum rate for a message flow",
              "link":"https://www.ibm.com/support/knowledgecenter/en/SSTTDS_11.0.0/com.ibm.etools.mft.doc/bj58270_.htm",
              "type":"web"
            }
          ]
        },
        "actions":{
          "title":"Create Actions",
          "details":[
            {
              "name":"Import",
              "method":"importArtifacts()"
            }
          ]
        }
      },
      "prepare":{
        "overview":{
          "name":"Prepare",
          "_prepareComment":"A description of what just happened when the user clicked Import, and what will happen when the user clicks Deploy.",
          "sections":[
            {
              "section":"<h4>Deploy the Application, Message Flow and Workload Management Policy</h4>"
            },
            {
              "section":"This tutorial assumes you have an Integration node owned integration server, or a stand-alone integration server already created. Other tutorials in the tutorial gallery will help you with this if you're not sure what this means."
            },
            {
              "section":"To deploy the artifacts locate the provided BAR file named <span class='msgflow'>wlm.bar</span> inside the application project named <span class='application'>WorkloadManagementApplication</span>, and drag and drop it on to your integration server in the Integration Explorer view (by default shown in the bottom left corner of your Toolkit)."
            }
          ]
        }
      },
      "run":{
        "overview":{
          "name":"Run",
          "heading":"Test the scenario",
          "_runComment":"The full steps for the user to run through the tutorial. Use 'sections' to render paragraphs, 'steps' with a type of 'ordered' or 'unordered' to render HTML lists, and 'substeps' to render nested lists.",
          "sections":[
            {
              "section":"To test the scenario, you will generate a workload of messages for the message flow which runs for one minute. The message processing rate will be reported. Next, you will update the Workload Management Policy and redeploy it before repeating the one minute test, which will demonstrate the message processing rate being limited."
            },
            {
              "section":"<h4>Generating a workload of messages</h4>"
            },
            {
              "section":"The PerfHarness Test Tool is a small java utility written by IBM and freely available to help you generate a workload of HTTP request messages that are processed by the <span class='msgflow'>WorkloadManagementFlow</span> message flow. The link below provides more details about the PerfHarness tool, but for simplicity the tool is already available for you to run from your Toolkit workspace using the projects you imported earlier in this tutorial:",
              "steps":{
                "type":"ordered",
                "details":[
                  {
                    "details":"Check the properties of your integration server to determine which port is being used by the HTTP Input node in the deployed message flow. By default this is likely to be port 7800."
                  },
                  {
                    "details":"Expand the <span class='application'>src</span> folder of the <span class='application'>PerfHarness</span> project, right-click <span class='application'>JMSPerfHarness.java</span> and choose the menu option Run As > Run Configurations. From the list, select Java Application and click the New button to create a new run configuration."
                  },
                  {
                    "details":"On the <span class='application'>Main</span> tab, check that <span class='varname'>Project = PerfHarness</span> and <span class='varname'>Main class = JMSPerfHarness</span>"
                  },
                  {
                    "details":"On the <span class='application'>Arguments</span> tab, copy and paste the following into the Program arguments text window: <code>-tc http.HTTPRequestor -rl 60 -jh localhost -jp <span class='varname'>{HTTPPort}</span> -mf <span class='varname'>{WorkspacePath}</span>/WorkloadManagementApplication/TestMessages/TestMessage.xml -wi 10 -to 10000 -sh false -ws 1 -dn 1 -sc BasicStats -ss 5 -nt 1 -ur wlm</code><br>where:<br><span class='varname'>{HTTPPort}</span> is the port the Integration Server is listening on for HTTP requests from the previous step<br><span class='varname'>{WorkspacePath}</span> is the location of your current Toolkit workspace."
                  },
                  {
                    "details":"On the <span class='application'>Classpath</span> tab, select <span class='application'>User Entries</span>, click <span class='application'>Add Projects</span>, and select the <span class='application'>HTTPPerfHarness</span> and <span class='application'>PerfHarness</span> projects"
                  },
                  {
                    "details":"When you click Run, the PerfHarness will run for 60 seconds and every 5 seconds output the message rate at which it is processing messages. The actual message rate achieved will be dependent upon the performance of your system but it needs to be in excess of 1 message per second for you to observe the effects of applying the Workload Management Policy in this tutorial."
                  }
                ]
              }
            },
            {
              "section":"<h4>Redeploy the Workload Management Policy with a lower rate to restrict the message throughput</h4>"
            },
            {
              "section":"Use the <span class='application'>WLM_MaxRate_Policy</span> Workload Management Policy to restrict the throughput of the <span class='msgflow'>WorkloadManagementFlow</span> message flow by completing the following steps:",
              "steps":{
                "type":"ordered",
                "details":[
                  {
                    "details":"Look inside the <span class='application'>MyPolicies</span> project, open <span class='application'>WLM_MaxRate_Policy</span> and change the <span class='application'>Maximum Rate (Messages per second)</span> parameter from its current value of 100000 to the value 1."
                  },
                  {
                    "details":"Deploy the update by dragging and dropping the <span class='application'>MyPolicies</span> project on to the integration server."
                  }
                ]
              }
            },
            {
              "section":"<h4>Re-run the workload with the new Workload Management Policy in place</h4>"
            },
            {
              "section":"Now the Workload Management Policy has been updated, repeat the same test as before and observe that the message processing rate has now been limited to 1 message per second."
            }
          ]
        },
        "helpLinks":{
          "title":"Find out more",
          "details":[
            {
              "title":"developerWorks link to ",
              "description":"Performance testing with PerfHarness",
              "link":"https://developer.ibm.com/open/2016/05/12/performance-testing-with-perfharness/",
              "type":"web"
            },
            {
              "title":"GitHub link to ",
              "description":"PerfHarness download",
              "link":"https://github.com/ot4i/perf-harness?cm_mc_uid=42692352179214933019160&cm_mc_sid_50200000=",
              "type":"web"
            }
          ]
        }
      }
    }
  }
}
